---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidProfileError
source: html/418869a2-2054-f065-1859-1ef7194dea86.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidProfileError Property

One or more profiles are invalid. Make sure that every used profile is a closed loop of non-intersecting lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidProfileError { get; }
```